*** How to do a Frequency Distribution of Quantitative Data
Taken from [[http://www.r-tutor.com/elementary-statistics/quantitative-data/frequency-distribution-quantitative-data][Frequency Distribution of Quantitative Data]] that uses the dataset faithful:

head(faithful)
  eruptions waiting
1     3.600      79
2     1.800      54
3     3.333      74
4     2.283      62
5     4.533      85
6     2.883      55

- First get range of data using range()
  #+BEGIN_SRC R 
  duration = faithful$eruptions 
  range(duration)
  #+END_SRC

  #+RESULTS:
  | 1.6 |
  | 5.1 |

- Break range into non-overlapping sub-intervals by defining a 
  sequence of equal distance break points using seq().
  #+BEGIN_SRC R 
  breaks = seq(1.5,5.5,by=0.5)
  #+END_SRC

  #+RESULTS:
  | 1.5 |
  |   2 |
  | 2.5 |
  |   3 |
  | 3.5 |
  |   4 |
  | 4.5 |
  |   5 |
  | 5.5 |

- Classify the eruption durations according to the half-unit-length sub-intervals with cut(). 
  As the intervals are to be closed on the left, and open on the right, we set the right argument as FALSE.
  #+BEGIN_SRC R 
  duration = faithful$eruptions 
  breaks = seq(1.5,5.5,by=0.5)
  duration.cut = cut(duration, breaks, right=F)
  #+END_SRC

  #+RESULTS:
  | [3.5,4) |
  | [1.5,2) |
  | [3,3.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [2.5,3) |
  | [4.5,5) |
  | [3.5,4) |
  | [1.5,2) |
  | [4,4.5) |
  | [1.5,2) |
  | [3.5,4) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [2,2.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4,4.5) |
  | [1.5,2) |
  | [1.5,2) |
  | [3,3.5) |
  | [3,3.5) |
  | [4.5,5) |
  | [3.5,4) |
  | [1.5,2) |
  | [4,4.5) |
  | [3.5,4) |
  | [4,4.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [3,3.5) |
  | [4,4.5) |
  | [3.5,4) |
  | [2,2.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4.5,5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4.5,5) |
  | [3,3.5) |
  | [3.5,4) |
  | [2,2.5) |
  | [4.5,5) |
  | [2,2.5) |
  | [4.5,5) |
  | [4.5,5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4.5,5) |
  | [3.5,4) |
  | [1.5,2) |
  | [4.5,5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4,4.5) |
  | [4,4.5) |
  | [4.5,5) |
  | [2,2.5) |
  | [4.5,5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [4,4.5) |
  | [1.5,2) |
  | [5,5.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [3.5,4) |
  | [3.5,4) |
  | [4,4.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [2.5,3) |
  | [4,4.5) |
  | [4.5,5) |
  | [3.5,4) |
  | [4.5,5) |
  | [2,2.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4,4.5) |
  | [4.5,5) |
  | [3.5,4) |
  | [1.5,2) |
  | [4.5,5) |
  | [2,2.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4.5,5) |
  | [3.5,4) |
  | [4.5,5) |
  | [2,2.5) |
  | [4.5,5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [2,2.5) |
  | [4.5,5) |
  | [1.5,2) |
  | [4,4.5) |
  | [2.5,3) |
  | [4,4.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [3.5,4) |
  | [1.5,2) |
  | [4.5,5) |
  | [2,2.5) |
  | [4.5,5) |
  | [1.5,2) |
  | [4,4.5) |
  | [2.5,3) |
  | [4,4.5) |
  | [1.5,2) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [2,2.5) |
  | [3.5,4) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [4.5,5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [2,2.5) |
  | [5,5.5) |
  | [1.5,2) |
  | [5,5.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [3.5,4) |
  | [4,4.5) |
  | [4.5,5) |
  | [4,4.5) |
  | [1.5,2) |
  | [3.5,4) |
  | [2,2.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [3.5,4) |
  | [3.5,4) |
  | [4.5,5) |
  | [2,2.5) |
  | [5,5.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [2,2.5) |
  | [4.5,5) |
  | [3,3.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [4.5,5) |
  | [2,2.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [4,4.5) |
  | [3.5,4) |
  | [2,2.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [1.5,2) |
  | [4.5,5) |
  | [4,4.5) |
  | [3.5,4) |
  | [4,4.5) |
  | [3.5,4) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [2,2.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4.5,5) |
  | [1.5,2) |
  | [4,4.5) |
  | [3.5,4) |
  | [1.5,2) |
  | [4.5,5) |
  | [2,2.5) |
  | [4.5,5) |
  | [1.5,2) |
  | [3.5,4) |
  | [3,3.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [2,2.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4,4.5) |
  | [1.5,2) |
  | [4,4.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [4,4.5) |
  | [3.5,4) |
  | [4.5,5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [1.5,2) |
  | [4,4.5) |
  | [3.5,4) |
  | [2,2.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4.5,5) |
  | [2.5,3) |
  | [4.5,5) |
  | [3.5,4) |
  | [2,2.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4,4.5) |
  | [3.5,4) |
  | [4.5,5) |
  | [4,4.5) |
  | [3.5,4) |
  | [3.5,4) |
  | [4,4.5) |
  | [2,2.5) |
  | [4,4.5) |
  | [4.5,5) |
  | [4.5,5) |
  | [1.5,2) |
  | [4,4.5) |
  | [1.5,2) |
  | [2,2.5) |
  | [4.5,5) |
  | [4,4.5) |
  | [2,2.5) |
  | [4,4.5) |
  | [1.5,2) |
  | [4,4.5) |

- Compute the frequency of eruptions in each sub-interval with the table()
  #+BEGIN_SRC R 
  duration.freq = table(duration.cut)
  #+END_SRC

- frequency distribution is below
  #+BEGIN_SRC R 
  duration.freq
  #+END_SRC

- To print result in column format use cbind()
  #+BEGIN_SRC R 
  cbind(duration.freq)
  #+END_SRC

*** [[http://www.theanalysisfactor.com/r-tutorial-count/][Counting Elements in a Data Set]]
Combining the lenght() and which() commands gives a handy method of countin
elements that meet particular criteria.
#+BEGIN_SRC R
d=c('a','c','a','e','b','e','d','c','e','b','c','a','d','b','b','d','e',
'b','c','c','a','c','e','e','c')
count <- function(letter) { length(which(d==letter)) }
count('a')
#+END_SRC

#+RESULTS:
: 4
To get a table of frequencies from dataset, 
#+BEGIN_SRC R
d=c('a','c','a','e','b','e','d','c','e','b','c','a','d','b','b','d','e',
'b','c','c','a','c','e','e','c')
table(d)
#+END_SRC

#+RESULTS:
| a | 4 |
| b | 5 |
| c | 7 |
| d | 3 |
| e | 6 |

To get a table of relative frequencies from dataset, 
#+BEGIN_SRC R
d=c('a','c','a','e','b','e','d','c','e','b','c','a','d','b','b','d','e',
'b','c','c','a','c','e','e','c')
table(d)/length(d)
#+END_SRC

#+RESULTS:
| a | 0.16 |
| b |  0.2 |
| c | 0.28 |
| d | 0.12 |
| e | 0.24 |

*** Factors R-Object
Stores vector along with the distinct values of the elements
#+BEGIN_SRC R
apple_colors <- c('green','green','yellow','red','red','red','green')
factor_apple <- factor(apple_colors)
print(factor_apple)
#+END_SRC

#+RESULTS:
| green  |
| green  |
| yellow |
| red    |
| red    |
| red    |
| green  |

#+BEGIN_SRC R
apple_colors <- c('green','green','yellow','red','red','red','green')
factor_apple <- factor(apple_colors)
print(nlevels(factor_apple))
#+END_SRC

#+RESULTS:
: 3
*** limit grouping
Turning [[https://www.r-bloggers.com/from-continuous-to-categorical/][From continuous to categorical]]
#+BEGIN_SRC R
x <- c(2,6,14,21,29,11,11,20,24,6,15,17,22,27,9,6,4,9,6,6)
mydata<-cut(x,seq(0,30,5),right=FALSE)
table(mydata)
#+END_SRC

#+RESULTS:
| [0,5)   | 2 |
| [5,10)  | 7 |
| [10,15) | 3 |
| [15,20) | 2 |
| [20,25) | 4 |
| [25,30) | 2 |

*** Quartiles
- Output of quantile function is a five-number summary
Q_0,Q_1,Q_2,Q_3,Q_4
#+BEGIN_SRC R
quantile(c(3,5,6,8,9,3,5,6,8,9))
#+END_SRC

#+RESULTS:
| 3 |
| 5 |
| 6 |
| 8 |
| 9 |
Here is a good reference for creating [[https://www.r-bloggers.com/box-plot-with-r-tutorial/][box-plots]]
- Interquartile range found with IQR function

*** Sample Standard Deviation for Single-Valued Grouped-Data
Mean of data set is 486.
#+BEGIN_SRC python
data=[280,430,660,850,940,280,280,430,430,280]
# f is the frequency distribution of data
f=[4,3,1,1,1]
a=map(lambda x : (x- 486)^2,data)
# use a list comprehension mixed with zip()
result=[x*y for x,y in zip(a,f)]
return result
#+END_SRC

#+RESULTS:
| -832 | -162 | 172 | 366 | 452 |

